# 作業 : (Kaggle)鐵達尼生存預測

# [作業目標]
- 試著完成三種不同特徵類型的三種資料操作, 觀察結果
- 思考一下, 這三種特徵類型, 哪一種應該最複雜/最難處理

# [作業重點]
- 完成剩餘的八種 類型 x 操作組合 (In[6]~In[13], Out[6]~Out[13])
- 思考何種特徵類型, 應該最複雜

In [1]:
# 載入基本套件
import pandas as pd
import numpy as np

# 讀取訓練與測試資料
data_path = 'data/'
df_train = pd.read_csv(data_path + 'titanic_train.csv')
df_test = pd.read_csv(data_path + 'titanic_test.csv')
df_train.shape

(891, 12)

In [2]:
# 重組資料成為訓練 / 預測用格式
train_Y = df_train['Survived']
ids = df_test['PassengerId']
df_train = df_train.drop(['PassengerId', 'Survived'] , axis=1)
df_test = df_test.drop(['PassengerId'] , axis=1)
df = pd.concat([df_train,df_test])
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# 秀出資料欄位的類型與數量
dtype_df = df.dtypes.reset_index()
dtype_df.columns = ["Count", "Column Type"]
dtype_df = dtype_df.groupby("Column Type").aggregate('count').reset_index()
dtype_df

  Column Type  Count
0       int64      3
1     float64      2
2      object      5

In [4]:
#確定只有 int64, float64, object 三種類型後, 分別將欄位名稱存於三個 list 中
int_features = []
float_features = []
object_features = []
for dtype, feature in zip(df.dtypes, df.columns):
    if dtype == 'float64':
        float_features.append(feature)
    elif dtype == 'int64':
        int_features.append(feature)
    else:
        object_features.append(feature)
print(f'{len(int_features)} Integer Features : {int_features}\n')
print(f'{len(float_features)} Float Features : {float_features}\n')
print(f'{len(object_features)} Object Features : {object_features}')

3 Integer Features : ['Pclass', 'SibSp', 'Parch']

2 Float Features : ['Age', 'Fare']

5 Object Features : ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

# 作業1 
* 試著執行作業程式，觀察三種類型 (int / float / object) 的欄位分別進行( 平均 mean / 最大值 Max / 相異值 nunique )  
中的九次操作會有那些問題? 並試著解釋那些發生Error的程式區塊的原因?  

# 作業2
* 思考一下，試著舉出今天五種類型以外的一種或多種資料類型，你舉出的新類型是否可以歸在三大類中的某些大類?  
所以三大類特徵中，哪一大類處理起來應該最複雜?

In [5]:
# 例 : 整數 (int) 特徵取平均 (mean)
df[int_features].mean()

Pclass    2.294882
SibSp     0.498854
Parch     0.385027
dtype: float64

In [66]:
# 請依序列出 三種特徵類型 (int / float / object) x 三種方法 (平均 mean / 最大值 Max / 相異值 nunique) 的其餘操作
"""
Your Code Here

"""


# 讀取訓練與測試資料

data_path = 'data/'
df_train = pd.read_csv(data_path + 'titanic_train.csv')
df_test = pd.read_csv(data_path + 'titanic_test.csv')
print(df_train.shape)

int_features = []
float_features = []
bool_features = []
object_features = []

for dtype, feature in zip(df.dtypes, df.columns):
    if dtype == 'float64':
        float_features.append(feature)
    elif dtype == 'int64':
        int_features.append(feature)
    elif dtype == 'bool':
        bool_features.append(feature)
    else:
        object_features.append(feature)
print(f'{len(int_features)} Integer Features : {int_features}\n')
print(f'{len(float_features)} Float Features : {float_features}\n')
print(f'{len(bool_features)} bool Features : {bool_features}\n')
print(f'{len(object_features)} Object Features : {object_features}')

(891, 12)
5 Integer Features : ['PassengerId', 'Survived', 'Pclass', 'SibSp', 'Parch']

8 Float Features : ['Age', 'Fare', 'PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

0 bool Features : []

10 Object Features : ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked', 'Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [67]:
df = pd.concat([df_train,df_test],axis =1 )

In [68]:
df[int_features].mean()

PassengerId     446.000000
PassengerId    1100.500000
Survived          0.383838
Pclass            2.308642
Pclass            2.265550
SibSp             0.523008
SibSp             0.447368
Parch             0.381594
Parch             0.392344
dtype: float64

In [69]:
df[int_features].max()

PassengerId     891.0
PassengerId    1309.0
Survived          1.0
Pclass            3.0
Pclass            3.0
SibSp             8.0
SibSp             8.0
Parch             6.0
Parch             9.0
dtype: float64

In [70]:
df[int_features].nunique()

PassengerId    891
PassengerId    418
Survived         2
Pclass           3
Pclass           3
SibSp            7
SibSp            7
Parch            7
Parch            8
dtype: int64

In [71]:
df[float_features].mean()

Age              29.699118
Age              30.272590
Fare             32.204208
Fare             35.627188
PassengerId     446.000000
PassengerId    1100.500000
Pclass            2.308642
Pclass            2.265550
Age              29.699118
Age              30.272590
SibSp             0.523008
SibSp             0.447368
Parch             0.381594
Parch             0.392344
Fare             32.204208
Fare             35.627188
dtype: float64

In [72]:
df[float_features].max()

Age              80.0000
Age              76.0000
Fare            512.3292
Fare            512.3292
PassengerId     891.0000
PassengerId    1309.0000
Pclass            3.0000
Pclass            3.0000
Age              80.0000
Age              76.0000
SibSp             8.0000
SibSp             8.0000
Parch             6.0000
Parch             9.0000
Fare            512.3292
Fare            512.3292
dtype: float64

In [73]:
df[float_features].nunique()

Age             88
Age             79
Fare           248
Fare           169
PassengerId    891
PassengerId    418
Pclass           3
Pclass           3
Age             88
Age             79
SibSp            7
SibSp            7
Parch            7
Parch            8
Fare           248
Fare           169
dtype: int64

In [74]:
df[object_features].mean()

Series([], dtype: float64)

In [75]:
df[object_features].max()

Name      van Melkebeke, Mr. Philemon
Sex                              male
Ticket                      WE/P 5735
Name      van Melkebeke, Mr. Philemon
Sex                              male
Ticket                      WE/P 5735
dtype: object

In [76]:
df[object_features].nunique()

Name        891
Name        418
Sex           2
Sex           2
Ticket      681
Ticket      363
Cabin       147
Cabin        76
Embarked      3
Embarked      3
Name        891
Name        418
Sex           2
Sex           2
Ticket      681
Ticket      363
Cabin       147
Cabin        76
Embarked      3
Embarked      3
dtype: int64

In [77]:
df[bool_features].mean()

Series([], dtype: float64)

In [78]:
df[bool_features].max()

Series([], dtype: float64)

In [79]:
df[bool_features].nunique()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[891 rows x 0 columns]

#取bool值,歸類在float,大部分都在float,float類最難複雜

In [80]:
df.describe

<bound method NDFrame.describe of      PassengerId  Survived Pclass  \
0              1         0      3
1              2         1      1
2              3         1      3
3              4         1      1
4              5         0      3
..           ...       ...    ...
886          887         0      2
887          888         1      1
888          889         0      3
889          890         1      1
890          891         0      3

                                                  Name     Sex   Age SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0     1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0     1
2                               Heikkinen, Miss. Laina  female  26.0     0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0     1
4                             Allen, Mr. William Henry    male  35.0     0
..                                                 ...     ...   ...   ...
886                              Montvila, Rev. Juozas    male  27.0     0
887                       Graham, Miss. Margaret Edith  female  19.0     0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN     1
889                              Behr, Mr. Karl Howell    male  26.0     0
890                                Dooley, Mr. Patrick    male  32.0     0

    Parch            Ticket     Fare  ... Pclass  \
0       0         A/5 21171   7.2500  ...    3.0
1       0          PC 17599  71.2833  ...    3.0
2       0  STON/O2. 3101282   7.9250  ...    2.0
3       0            113803  53.1000  ...    3.0
4       0            373450   8.0500  ...    3.0
..    ...               ...      ...  ...    ...
886     0            211536  13.0000  ...    NaN
887     0            112053  30.0000  ...    NaN
888     2        W./C. 6607  23.4500  ...    NaN
889     0            111369  30.0000  ...    NaN
890     0            370376   7.7500  ...    NaN

                                             Name     Sex   Age SibSp Parch  \
0                                Kelly, Mr. James    male  34.5   0.0   0.0
1                Wilkes, Mrs. James (Ellen Needs)  female  47.0   1.0   0.0
2                       Myles, Mr. Thomas Francis    male  62.0   0.0   0.0
3                                Wirz, Mr. Albert    male  27.0   0.0   0.0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0   1.0   1.0
..                                            ...     ...   ...   ...   ...
886                                           NaN     NaN   NaN   NaN   NaN
887                                           NaN     NaN   NaN   NaN   NaN
888                                           NaN     NaN   NaN   NaN   NaN
889                                           NaN     NaN   NaN   NaN   NaN
890                                           NaN     NaN   NaN   NaN   NaN

      Ticket     Fare  Cabin Embarked
0     330911   7.8292    NaN        Q
1     363272   7.0000    NaN        S
2     240276   9.6875    NaN        Q
3     315154   8.6625    NaN        S
4    3101298  12.2875    NaN        S
..       ...      ...    ...      ...
886      NaN      NaN    NaN      NaN
887      NaN      NaN    NaN      NaN
888      NaN      NaN    NaN      NaN
889      NaN      NaN    NaN      NaN
890      NaN      NaN    NaN      NaN

[891 rows x 23 columns]>